proposal.tex
% Created 2018-02-02 fre 17:05
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Axel Demborg}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Axel Demborg},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Preliminary thesis title}
\label{sec:orgc8faeb1}
Efficient object segmentation on mobile phones

\section{Background/Conditions}
\label{sec:orgfbf0f0e}
For 3D scanning of human bodies specialized hardware has traditionally been used. With the resent developments in segmentation and spacial understanding for convolutional neural networks, high performance 3D modeling might be achievable with commodity hardware such as high end smartphones. This will be evaluated in this project.

The project will be carried out at Volumental a Stockholm based computer vision company from RPL, KTH active in 3D body scanning and product recommendation based on 3D measurements in footwear.

\section{Research questions}
\label{sec:org77a8a17}
Since AlexNet published in 2012, Convolutional Neural Networks has
ushered a new era in computer vision, consistently improving object
detection and segmentation accuracy. In image segmentation, the latest
promising work on this front is Mask R-CNN, a region proposing network
for object segmentation, building upon a series of CNNs for object
detection\footnote{\href{https://blog.athelas.com/a-brief-history-of-cnns-in-image-segmentation-from-r-cnn-to-mask-r-cnn-34ea83205de4}{A brief history of CNNS in image segmentation}}. This Msc thesis is about implementing Mask R-CNN that
can run on flagship iPhone with the end goal of 3D scanning human
bodies. As such, the thesis combines theoretical understanding of CNNs
with the practice of running it on mobile devices.

It is reasonable to expect that results from this thesis will be comparable to but not as good as results from dedicated hardware. Evaluation will be performed against Volumental's preexisting datasets of feet scanned using the companies own scanner.

\section{Background of the degree project student}
\label{sec:org416048e}
As a masters student in machine learning with a specialization in deep learning from the courses ID2223 (Scalable Machine Learning and Deep Learning) and DD2424 (Deep Learning in Data Science) as well as experience with 3D modeling from DD2429 (Computational Photography) I feel very well suited for this project.

\section{Supervisor at the company}
\label{sec:orgbeefd3a}
The supervisor at the company will be Alper Aydemir Co-founder and CTO of the company. He has a PhD from RPL at KTH and has experience in 3D modeling and computer vision from both JPL and Google X.  

\section{Limits/Resources}
\label{sec:org5963224}
The company has extensive expertise in computer vision and machine learning as well as datasets for 3D modeling. Thus there is a solid foundation in place to build the thesis upon.

\section{Eligibility and study planing}
\label{sec:org6a3dab3}
I assure that I have completed all courses up until this point, this includes all the courses from the bachelors' degree, the course in scientific theory and method as well as all the courses relevant for the thesis. This sums up to over 60 points of second cycle courses and since no courses are remaining there is nothing to plan for those.
\end{document}
